{
  "tables": [
    {
      "columns": [
        {
          "definition": "A unique identifier for each sales order ticket. This ID is auto-generated and serves as the primary key for the SalesOrderTicket table.",
          "name": "SalesOrderID",
          "type": "INT"
        },
        {
          "definition": "The date and time when the sales order was created. This is used to track when the order was initiated.",
          "name": "OrderDate",
          "type": "DATETIME"
        },
        {
          "definition": "The date by which the order is expected to be fulfilled or delivered. It helps in managing delivery timelines.",
          "name": "DueDate",
          "type": "DATETIME"
        },
        {
          "definition": "The date when the order was shipped to the customer. This is used for tracking shipping and fulfillment status.",
          "name": "ShipDate",
          "type": "DATETIME"
        },
        {
          "allowed_values": [
            1,
            2,
            3
          ],
          "definition": "The current status of the order, represented as a numeric code (e.g., 1 for In Progress, 2 for Completed, 3 for Canceled).",
          "name": "Status",
          "type": "TINYINT"
        },
        {
          "definition": "The total amount due for the order, including all line items, taxes, and shipping charges.",
          "name": "TotalDue",
          "type": "MONEY"
        },
        {
          "definition": "The date and time when the sales order ticket record was last modified. This is used for tracking updates and changes to the order.",
          "name": "ModifiedDate",
          "type": "DATETIME"
        }
      ],
      "description": "This table stores detailed information about sales order tickets, including the order details, customer information, order status, and timestamps. It is used to manage and track sales orders throughout the order lifecycle, from creation to fulfillment.",
      "entity": "SalesOrderDetail",
      "selector": "Use this table to retrieve or store information related to individual sales order tickets. This is applicable when processing sales orders, managing customer transactions, or tracking order fulfillment status.",
      "table_name": "Sales Order Detail"
    },
    {
      "columns": [
        {
          "definition": "A unique identifier for each sales order. This ID is auto-generated and serves as the primary key for the SalesOrderHeader table.",
          "name": "SalesOrderID",
          "type": "INT"
        },
        {
          "definition": "The date and time when the sales order was created. This field is used to track when the order was initiated.",
          "name": "OrderDate",
          "type": "DATETIME"
        },
        {
          "definition": "The date by which the order is expected to be fulfilled or delivered. It helps in managing delivery timelines.",
          "name": "DueDate",
          "type": "DATETIME"
        },
        {
          "definition": "The date when the order was shipped to the customer. This is used for tracking shipping and fulfillment status.",
          "name": "ShipDate",
          "type": "DATETIME"
        },
        {
          "allowed_values": [
            1,
            2,
            3
          ],
          "definition": "The current status of the order, represented as a numeric code (e.g., 1 for In Progress, 2 for Completed, 3 for Canceled).",
          "name": "Status",
          "type": "TINYINT"
        },
        {
          "allowed_values": [
            "True",
            "False"
          ],
          "definition": "Indicates whether the order was placed online.",
          "name": "OnlineOrderFlag",
          "type": "BIT"
        },
        {
          "definition": "A unique order number assigned to the sales order. This is used for tracking and identification purposes.",
          "name": "SalesOrderNumber",
          "type": "NVARCHAR(25)"
        },
        {
          "definition": "The purchase order number provided by the customer. This field links the sales order to the customer's purchase order.",
          "name": "PurchaseOrderNumber",
          "type": "NVARCHAR(25)"
        },
        {
          "definition": "The account number of the customer placing the order. This helps link the order to the customer's account.",
          "name": "AccountNumber",
          "type": "NVARCHAR(15)"
        },
        {
          "definition": "A foreign key that links to the Customer table, representing the customer who placed the order.",
          "name": "CustomerID",
          "type": "INT"
        },
        {
          "definition": "A foreign key that links to the Address table, representing the shipping address for the order.",
          "name": "ShipToAddressID",
          "type": "INT"
        },
        {
          "definition": "A foreign key that links to the Address table, representing the billing address for the order.",
          "name": "BillToAddressID",
          "type": "INT"
        },
        {
          "definition": "The shipping method used for the order (e.g., UPS, FedEx). This field helps track shipping preferences.",
          "name": "ShipMethod",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The total cost of the order before taxes and shipping charges. This field is used to calculate the final total. The currency is pound sterling (GBP).",
          "name": "SubTotal",
          "type": "MONEY"
        },
        {
          "definition": "The tax amount applied to the order. This is calculated based on the order subtotal and applicable tax rates. The currency is pound sterling (GBP).",
          "name": "TaxAmt",
          "type": "MONEY"
        },
        {
          "definition": "The shipping charge applied to the order. This field represents the cost of shipping the order to the customer. The currency is pound sterling (GBP).",
          "name": "Freight",
          "type": "MONEY"
        },
        {
          "definition": "The total amount due for the order, including all line items, taxes, and shipping charges. The currency is pound sterling (GBP).",
          "name": "TotalDue",
          "type": "MONEY"
        },
        {
          "definition": "Any additional comments or notes related to the sales order. This field can include special instructions or remarks.",
          "name": "Comment",
          "type": "NVARCHAR(255)"
        },
        {
          "definition": "The date and time when the sales order header record was last modified. This is used for tracking updates and changes to the order.",
          "name": "ModifiedDate",
          "type": "DATETIME"
        }
      ],
      "description": "This table contains high-level information about sales orders, including order dates, customer details, shipping information, and order status. It is used to manage and track sales orders from initiation to fulfillment.",
      "entity": "SalesOrderHeader",
      "selector": "Use this table to retrieve or store information related to the overall details of a sales order. It is applicable when you need to track order status, manage order dates, or relate orders to customers and shipping information.",
      "table_name": "Sales Order Header"
    },
    {
      "columns": [
        {
          "definition": "A unique identifier for each address. This ID is auto-generated and serves as the primary key for the Address table.",
          "name": "AddressID",
          "type": "INT"
        },
        {
          "definition": "The city in which the address is located. This is used to specify the city for the address.",
          "name": "City",
          "type": "NVARCHAR(30)"
        },
        {
          "definition": "The state or province in which the address is located. This is used to specify the state or province for the address.",
          "name": "StateProvince",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The country or region in which the address is located. This is used to specify the country or region for the address.",
          "name": "CountryRegion",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The postal code associated with the address. This is used to specify the postal code for the address, which helps in geographical sorting and shipping.",
          "name": "PostalCode",
          "type": "NVARCHAR(15)"
        },
        {
          "definition": "The date and time when the address record was last modified. This is used for tracking updates and changes to the address information.",
          "name": "ModifiedDate",
          "type": "DATETIME"
        }
      ],
      "description": "This table stores address information for customers, including street addresses, city, state, postal code, and country/region. It is used to maintain contact and shipping information for orders, as well as to manage customer locations.",
      "entity": "Address",
      "selector": "Use this table to retrieve or store address details for customers, shipping locations, or billing addresses. It is applicable in scenarios where location information is required, such as shipping orders, verifying customer addresses, or managing geographical data.",
      "table_name": "Address"
    }
  ],
  "views": [
    {
      "columns": [
        {
          "definition": "A unique identifier for each product category. This ID is used to reference specific categories.",
          "name": "ProductCategoryID",
          "type": "INT"
        },
        {
          "definition": "The name of the parent product category. This represents the top-level category under which subcategories are grouped.",
          "name": "ParentProductCategoryName",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The name of the product category. This can refer to either a top-level category or a subcategory, depending on the context.",
          "name": "ProductCategoryName",
          "type": "NVARCHAR(50)"
        }
      ],
      "description": "This view provides a comprehensive list of all product categories and their corresponding subcategories in the SalesLT schema of the AdventureWorksLT database. It is used to understand the hierarchical structure of product categories, facilitating product organization and categorization.",
      "entity": "vGetAllCategories",
      "selector": "Use this view to retrieve information about product categories and subcategories. It is useful for scenarios where product categorization is required, such as generating reports based on product categories or filtering products by category.",
      "view_name": "Get All Categories"
    },
    {
      "columns": [
        {
          "definition": "A unique identifier for each product. This ID is used to distinguish individual products.",
          "name": "ProductID",
          "type": "INT"
        },
        {
          "definition": "The name of the product. This provides a brief and identifiable name for each product.",
          "name": "Name",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The model name associated with the product. This indicates the specific model type or version of the product.",
          "name": "ProductModel",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The culture or language code for the product description. This is used to localize the product description, such as 'en' for English or 'fr' for French.",
          "name": "Culture",
          "sample_values": [
            "en",
            "fr",
            "es",
            "de"
          ],
          "type": "NVARCHAR(6)"
        },
        {
          "definition": "A detailed description of the product. This text provides additional information about the product, which can vary based on the culture or language.",
          "name": "Description",
          "type": "NVARCHAR(400)"
        }
      ],
      "description": "This view provides detailed information about products, including their names, associated product models, descriptions, and the specific culture or language of the description. It is useful for understanding product details and translating product descriptions for different cultures.",
      "entity": "vProductAndDescription",
      "selector": "Use this view when you need comprehensive details about products, including their descriptions in different languages. This view is particularly useful for multilingual product catalogs or when creating localized content.",
      "view_name": "Product and Description"
    },
    {
      "columns": [
        {
          "definition": "A unique identifier for each product model. This ID is used to distinguish different product models.",
          "name": "ProductModelID",
          "type": "INT"
        },
        {
          "definition": "The name of the product model, providing a recognizable title for each model.",
          "name": "Name",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "A brief summary of the product model, highlighting key features and characteristics.",
          "name": "Summary",
          "type": "NVARCHAR(MAX)"
        },
        {
          "definition": "The name of the manufacturer of the product model.",
          "name": "Manufacturer",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "Copyright information related to the product model, indicating the legal ownership of the product design and content.",
          "name": "Copyright",
          "type": "NVARCHAR(30)"
        },
        {
          "definition": "The URL for the product model, providing a link to more information or to purchase the product.",
          "name": "ProductURL",
          "type": "NVARCHAR(256)"
        },
        {
          "definition": "The duration of the warranty period for the product model, specifying how long the warranty is valid.",
          "name": "WarrantyPeriod",
          "type": "NVARCHAR(30)"
        },
        {
          "definition": "A description of the warranty provided for the product model, detailing what is covered under the warranty.",
          "name": "WarrantyDescription",
          "type": "NVARCHAR(255)"
        },
        {
          "definition": "The number of years the warranty is valid for the product model.",
          "name": "NoOfYears",
          "type": "INT"
        },
        {
          "definition": "A description of the maintenance requirements and recommendations for the product model.",
          "name": "MaintenanceDescription",
          "type": "NVARCHAR(MAX)"
        },
        {
          "definition": "Details about the type of wheels used in the product model.",
          "name": "Wheel",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "Information about the saddle of the product model, such as material and design.",
          "name": "Saddle",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "Details regarding the pedal design and specifications of the product model.",
          "name": "Pedal",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "Description of the bike frame used in the product model, including material and type.",
          "name": "BikeFrame",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "Information about the crankset of the product model, specifying its design and features.",
          "name": "Crankset",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The angle at which the product model is photographed, providing a visual perspective of the product.",
          "name": "PictureAngle",
          "type": "NVARCHAR(20)"
        },
        {
          "definition": "The size of the product model's picture, specifying dimensions or resolution.",
          "name": "PictureSize",
          "type": "NVARCHAR(20)"
        },
        {
          "definition": "An identifier linking to the product photo, which provides a visual representation of the product model.",
          "name": "ProductPhotoID",
          "type": "INT"
        },
        {
          "definition": "The material used in the construction of the product model, indicating durability and quality.",
          "name": "Material",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The color of the product model, providing information about the appearance of the product.",
          "name": "Color",
          "type": "NVARCHAR(15)"
        },
        {
          "definition": "A code representing the product line to which the model belongs, categorizing the product within a broader product range.",
          "name": "ProductLine",
          "type": "NVARCHAR(2)"
        },
        {
          "definition": "The style of the product model, indicating design and aesthetic aspects.",
          "name": "Style",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "A description of the target rider's experience level for which the product model is designed, such as beginner, intermediate, or expert.",
          "name": "RiderExperience",
          "type": "NVARCHAR(50)"
        },
        {
          "definition": "The date and time when the product model information was last modified, indicating the currency of the data.",
          "name": "ModifiedDate",
          "type": "DATETIME"
        }
      ],
      "description": "This view provides detailed catalog information about product models, including descriptions, manufacturing details, warranty information, and specifications related to product design and features. It is useful for generating comprehensive product catalogs and providing detailed product information to customers.",
      "entity": "vProductModelCatalogDescription",
      "selector": "Use this view when you need to retrieve detailed product model descriptions, manufacturing information, and specifications. It is particularly useful for creating product catalogs, detailing product features, and providing warranty information.",
      "view_name": "Product Model Catalog Description"
    }
  ]
}
