{
  "Columns": [
    {
      "AllowedValues": null,
      "DataType": "nvarchar",
      "Definition": "The ParentProductCategoryName column in the SalesLT.vGetAllCategories entity contains the names of the top-level product categories. Each value represents a broad category under which multiple subcategories and products are grouped. Examples of these top-level categories include Components, Clothing, Bikes, and Accessories. This column helps in identifying and organizing products based on their primary category.",
      "Name": "ParentProductCategoryName",
      "SampleValues": [
        "Components",
        "Clothing",
        "Bikes",
        "Accessories"
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "nvarchar",
      "Definition": "The ProductCategoryName column in the SalesLT.vGetAllCategories entity contains a list of names for different product categories. These names represent various types of products, such as cycling gear and accessories. Each value in this column is a descriptive name that helps categorize and organize products within the database.",
      "Name": "ProductCategoryName",
      "SampleValues": [
        "Panniers",
        "Jerseys",
        "Cranksets",
        "Fenders",
        "Caps"
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "int",
      "Definition": "The ProductCategoryID column in the SalesLT.vGetAllCategories entity contains unique identifier numbers for different product categories. The values are integers that represent specific categories within the product database. The column is used to categorize products into distinct groups for organizational and reporting purposes. Each number corresponds to a specific product category.",
      "Name": "ProductCategoryID",
      "SampleValues": [
        35,
        12,
        11,
        20,
        9
      ]
    }
  ],
  "CompleteEntityRelationshipsGraph": null,
  "Database": "AdventureWorksLT",
  "Definition": "SalesLT.vGetAllCategories is an entity that provides a hierarchical view of product categories, showing both parent and child categories along with their respective names and unique identifiers. This entity is useful for understanding the structure and relationships between different product categories within a catalog. It can be used to answer questions related to the organization of product categories, such as finding all subcategories under a specific parent category or determining the parent category of a given product category.",
  "Entity": "SalesLT.vGetAllCategories",
  "EntityName": "Product Categories Overview",
  "EntityRelationships": null,
  "Warehouse": null
}
