{
  "Columns": [
    {
      "AllowedValues": null,
      "DataType": "int",
      "Definition": "The SalesOrderID column in the SalesLT.SalesOrderDetail entity contains unique identifiers for each sales order. The values in this column are integer numbers that follow a sequential pattern, indicating they may be auto-incremented. It is used to link each sales order detail to its corresponding sales order record in the database. This column is essential for queries that need to filter or join sales order details based on specific sales orders.",
      "Name": "SalesOrderID",
      "SampleValues": [
        71796,
        71923,
        71783,
        71863,
        71920
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "int",
      "Definition": "The SalesOrderDetailID column in the SalesLT.SalesOrderDetail entity contains unique identifier values for each sales order detail record. These values are numeric and incrementally assigned, ensuring that each sales order detail can be distinctly identified. The column serves as a primary key within the SalesOrderDetail table.",
      "Name": "SalesOrderDetailID",
      "SampleValues": [
        110712,
        111455,
        110669,
        112996,
        113270
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "smallint",
      "Definition": "The OrderQty column in the SalesLT.SalesOrderDetail entity contains numerical values representing the quantity of each item ordered in a sales transaction. These values are integers indicating how many units of a particular product were purchased. The column helps in assessing the volume of sales per order line item. Common values are positive whole numbers.",
      "Name": "OrderQty",
      "SampleValues": [
        3,
        8,
        11,
        10,
        13
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "int",
      "Definition": "The ProductID column in the SalesLT.SalesOrderDetail entity contains unique numerical identifiers for products involved in sales orders. The values in this column are integers that correlate to specific products within the product catalog. Each ProductID is linked to detailed product information, ensuring accurate tracking and management of sales transactions.",
      "Name": "ProductID",
      "SampleValues": [
        994,
        809,
        886,
        951,
        793
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "money",
      "Definition": "The UnitPrice column in the SalesLT.SalesOrderDetail entity contains the price of individual items sold in a sales transaction. The values are represented as monetary amounts with up to four decimal places, indicating precision in pricing. These unit prices likely reflect the sale price of products before any applicable discounts or taxes are applied.",
      "Name": "UnitPrice",
      "SampleValues": [
        "112.9980",
        "29.9940",
        "461.6940",
        "40.5942",
        "323.9940"
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "money",
      "Definition": "The UnitPriceDiscount column in the SalesLT.SalesOrderDetail entity represents the discount applied to the unit price of items in a sales order. The values are decimal numbers indicating the fraction of the discount; for example, a value of 0.4000 indicates a 40% discount, 0.1000 indicates a 10% discount, and so on. The values range from 0.0000 (no discount) to 1.0000 (100% discount). This column helps in calculating the discounted price for each item in the sales order.",
      "Name": "UnitPriceDiscount",
      "SampleValues": [
        "0.4000",
        "0.1000",
        "0.0500",
        "0.0200",
        "0.0000"
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "numeric",
      "Definition": "The LineTotal column in the SalesLT.SalesOrderDetail entity contains the total price for each sales order line item. The values are numeric and represent the monetary amount in the currency used for the sale. This column captures the final cost after any discounts and adjustments have been applied to the individual product within the sales order. The values typically have several decimal places indicating precise currency amounts.",
      "Name": "LineTotal",
      "SampleValues": [
        "238.659792",
        "1943.964000",
        "809.760000",
        "135.597600",
        "404.664000"
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "uniqueidentifier",
      "Definition": "The rowguid column in the SalesLT.SalesOrderDetail entity contains unique identifier values for each sales order detail row. The values in this column are in the format of a GUID (Globally Unique Identifier), which is a 128-bit number used to uniquely identify data in a database. Each value is unique and follows a standard format consisting of alphanumeric characters and hyphens. This column ensures that each row can be distinctly identified in a large and distributed data environment.",
      "Name": "rowguid",
      "SampleValues": [
        "A6E8D782-457A-413E-8ED9-ED74F8353CD9",
        "9D987E75-E96D-4903-BE36-0CE579A6F47B",
        "174A0011-0CD4-44CE-952B-CEA83042A4C9",
        "D9D2A6AD-347A-4C99-85A0-F6F037A3A683",
        "A96ADF3D-3F0E-439F-AD3C-23846C5F51EC"
      ]
    },
    {
      "AllowedValues": null,
      "DataType": "datetime",
      "Definition": "The ModifiedDate column in the SalesLT.SalesOrderDetail entity contains timestamp values indicating the date and time when a particular sales order detail record was last modified. The values follow the standard date-time format of 'YYYY-MM-DD HH:MM:SS'. This column is typically used for tracking changes, performing audits, or identifying when the latest updates were made to the sales order details.",
      "Name": "ModifiedDate",
      "SampleValues": [
        "2008-06-01 00:00:00"
      ]
    }
  ],
  "CompleteEntityRelationshipsGraph": [
    "SalesLT.SalesOrderDetail -> SalesLT.Product",
    "SalesLT.SalesOrderDetail -> SalesLT.Product -> SalesLT.ProductCategory",
    "SalesLT.SalesOrderDetail -> SalesLT.Product -> SalesLT.ProductModel",
    "SalesLT.SalesOrderDetail -> SalesLT.Product -> SalesLT.ProductModel -> SalesLT.ProductModelProductDescription",
    "SalesLT.SalesOrderDetail -> SalesLT.Product -> SalesLT.ProductModel -> SalesLT.ProductModelProductDescription -> SalesLT.ProductDescription",
    "SalesLT.SalesOrderDetail -> SalesLT.SalesOrderHeader",
    "SalesLT.SalesOrderDetail -> SalesLT.SalesOrderHeader -> SalesLT.Address",
    "SalesLT.SalesOrderDetail -> SalesLT.SalesOrderHeader -> SalesLT.Address -> SalesLT.CustomerAddress",
    "SalesLT.SalesOrderDetail -> SalesLT.SalesOrderHeader -> SalesLT.Address -> SalesLT.CustomerAddress -> SalesLT.Customer"
  ],
  "Database": "AdventureWorksLT",
  "Definition": "The SalesLT.SalesOrderDetail entity contains detailed information about individual sales order items. It includes data on the quantity of products ordered, the unit price, any discounts applied, and the total price for each line item within a sales order. This entity is useful for answering questions related to the specifics of a sales order, such as the breakdown of order quantities, pricing details, and discount information for individual products in each order. It also provides unique identifiers for sales orders and line items, along with modification timestamps for tracking changes.",
  "Entity": "SalesLT.SalesOrderDetail",
  "EntityName": "Sales Order Details",
  "EntityRelationships": [
    {
      "ForeignEntity": "SalesLT.Product",
      "ForeignKeys": [
        {
          "Column": "ProductID",
          "ForeignColumn": "ProductID"
        }
      ]
    },
    {
      "ForeignEntity": "SalesLT.SalesOrderHeader",
      "ForeignKeys": [
        {
          "Column": "SalesOrderID",
          "ForeignColumn": "SalesOrderID"
        },
        {
          "Column": "SalesOrderID",
          "ForeignColumn": "SalesOrderID"
        }
      ]
    }
  ],
  "Warehouse": null
}
